# WallCrossSectionDefinition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..WallCrossSectionDefinition Property
GroupTypeId Class See Also
---
Cross-Section Definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId WallCrossSectionDefinition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallCrossSectionDefinition As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallCrossSectionDefinition {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace